1s/ERP/Conf/Documents/Лико_ЗаказНаРаскрой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаказНаРаскрой</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_РаскройМатериаловПланФакт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЭтапыВыполненияЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураВыпуск</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочныйМетражРезки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодрезкаКромка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлениеРоликов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативРезки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполненияПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскройСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыЗаказовБЭ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполненияПланВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПараметрыРасчетаРаскрояМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНастройкиПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНастройкиПланВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРаботыПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРаботыПланВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериалНаМашине</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ОбъектРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Раскрой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРоликов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаРолика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СнятьРезерв</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоРаскрою</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Печатник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетражПоЗаказу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПечати</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБланка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_РаскройМатериаловПланФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_РаскройМатериаловПланФакт</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаказНаРаскрой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаказНаРаскрой/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
		АвторДокумента=ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
		Ответственный=ПараметрыСеанса.ТекущийПользователь;
		Состояние=Справочники.Лико_ЭтапыВыполненияЗаказа.Производство;
		Номенклатура=Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	УстановитьПривилегированныйРежим(Истина);
	РаскройСтрокой=ПолучитьРаскройСтрокой(); 

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Или ВидРабот<>Ссылка.ВидРабот Тогда

		ОбменДанными.Загрузка=Истина;
		Записать();
		ОбменДанными.Загрузка=Ложь;

	КонецЕсли;


	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);	




	Если Не ЗначениеЗаполнено(ВидРабот) Тогда
		ВидРабот=Справочники.ВидыРаботСотрудников.РаскройМатериала;
	КонецЕсли;

	//ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);		
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);	
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда 	
		Если Состояние<>Ссылка.Состояние И Состояние=Справочники.Лико_ЭтапыВыполненияЗаказа.ЗакрытиеЗаказа Тогда
			Закрыт=Истина;
			ДатаЗакрытия=ТекущаяДата();
		Иначе
			Закрыт=Ложь;
			ДатаЗакрытия=Неопределено;
		КонецЕсли;

	КонецЕсли;

	Номен=?(ТипЗнч(Номенклатура)=Тип("СправочникСсылка.ЦеновыеГруппы"),Номенклатура.ОсновнаяНоменклатура,Номенклатура);
	КоличествоНожей= Раскрой.Итог("КоличествоРоликов")+?(ПодрезкаКромка,1,-1); 

	Правило=Справочники.Лико_ПараметрыРасчетаРаскрояМатериалов.ОпределитьПравило(Номенклатура,,Ссылка); 
	Если ЗначениеЗаполнено(Правило) Тогда
		
		Если ВидРабот= Справочники.ВидыРаботСотрудников.Переворот Тогда
			
			ПЗВ=Документы.Лико_ЗаказНаРаскрой.ПЗВПереворот();	
		Иначе
			ПЗВ=Документы.Лико_ЗаказНаРаскрой.ПЗВ();	
		КонецЕсли;
		

		КоличествоРоликов=Раскрой.Итог("КоличествоРоликов");  

		Если КоличествоРоликов=0  Тогда   	
			СредняяДлинаРолика=Документы.Лико_ЗаказНаРаскрой.СредняяДлинаРоика(); 
			//КоличествоРоликов=Окр(КоличествоУпаковок/СредняяДлинаРолика)*ЗаказКлиента.РучьиПечати;
			КоличествоРоликов=ЗаказКлиента.РучьиПечати; 
			КоличествоНожей= КоличествоРоликов+?(ПодрезкаКромка,1,-1); 

		Иначе   		   
			//СредняяДлинаРолика=КоличествоУпаковок/КоличествоРоликов;
			СредняяДлинаРолика=Раскрой[0].ДлинаРолика;
			//КоличествоРоликов=Окр(КоличествоУпаковок/СредняяДлинаРолика)*Раскрой.Итог("КоличествоРоликов");
		КонецЕсли;
		Попытка

			ВремяРезкиМин=ПЗВ+
			КоличествоУпаковок/Правило.Скорость+
			КоличествоУпаковок/СредняяДлинаРолика*(Правило.ВремяСъема+КоличествоРоликов*Правило.ВремяРолика)
			+КоличествоУпаковок/Правило.ДлинаЮмбы*Правило.ВремяЮмбы+
			(КоличествоНожей)*Правило.ВремяНастройкиНожей;
			ВремяВыполненияПлан=ВремяРезкиМин/60;

			ВремяРаботыМин=КоличествоУпаковок/Правило.Скорость
			+КоличествоУпаковок/СредняяДлинаРолика*(Правило.ВремяСъема+КоличествоРоликов*Правило.ВремяРолика)
			+КоличествоУпаковок/Правило.ДлинаЮмбы*Правило.ВремяЮмбы;
			ВремяРаботыПлан=ВремяРаботыМин/60;

			ВремяНастройки=ПЗВ+(КоличествоНожей)*Правило.ВремяНастройкиНожей;
			ВремяНастройкиПлан=ВремяНастройки/60;


			ВремяВыполненияПланВремя=Документы.Лико_ЗаказНаРаскрой.ФорматироватьЧислоКакВремя(ВремяВыполненияПлан);
			ВремяРаботыПланВремя=Документы.Лико_ЗаказНаРаскрой.ФорматироватьЧислоКакВремя(ВремяРаботыПлан);
			ВремяНастройкиПланВремя=Документы.Лико_ЗаказНаРаскрой.ФорматироватьЧислоКакВремя(ВремяНастройкиПлан);


		Исключение
			//ОписаниеОшибки()
		КонецПопытки;

	КонецЕсли;

	//B12+ 
	//B14/B5+
	//B14/B15*B6
	//+B16*B7+
	//B14/B4*B8+
	//(B16+1)*B9 

	//$B12+
	//$B23/B5+
	//$B23/$B24*(B6+$B25*B7)+
	//$B23/B4*B8+
	//($B25+1)*B9   

	//ВремяРезкиМин=ПЗВ
	//+КоличествоУпаковок/Правило.Скорость
	//+КоличествоУпаковок/СредняяДлинаРолика*(Правило.ВремяСъема+КоличествоРоликов*Правило.ВремяРолика)
	//+КоличествоУпаковок/Правило.ДлинаЮмбы*Правило.ВремяЮмбы
	//+(КоличествоРоликов+1)*Правило.ВремяНастройкиНожей;



	Если ЗначениеЗаполнено(ЗаказКлиента) И Раскрой.Итог("КоличествоРоликов")=0 Тогда
		КоличествоНожей=Макс(КоличествоНожей,ЗаказКлиента.РучьиПечати+1);
	КонецЕсли;


	НормативРезки=Справочники.Лико_ПараметрыРасчетаРаскрояМатериалов.ОпределитьНормативРезки(Номен,КоличествоНожей,КоличествоУпаковок,Правило);

	Если НормативРезки=0 Тогда
		НормативРезки=1;
	КонецЕсли;


КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
   УстановитьПривилегированныйРежим(Истина);
	Движения.Лико_РаскройМатериаловПланФакт.Записывать = Истина;

	Движение=Движения.Лико_РаскройМатериаловПланФакт.ДобавитьПриход();
	Движение.Период=Дата;
	Движение.Заказ=Ссылка;
	Движение.Количество=КоличествоУпаковок;
	
	
КонецПроцедуры

Процедура СтруктураПараметровЗаписиОбъекта() 	
	
	Если Не ДополнительныеСвойства.Свойство("ЕстьВопросыПередЗаписью") ТОгда
		ДополнительныеСвойства.Вставить("ЕстьВопросыПередЗаписью", Ложь);
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("НовыйОбъект") ТОгда
		ДополнительныеСвойства.Вставить("НовыйОбъект", Ложь); 		
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("ПринудительноЗакрытьФорму") ТОгда
		ДополнительныеСвойства.Вставить("ПринудительноЗакрытьФорму", Ложь); 		
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("РежимЗаписи") ТОгда
		ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);		
	КонецЕсли; 	
	Если Не ДополнительныеСвойства.Свойство("РежимПроведения") ТОгда
		ДополнительныеСвойства.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный); 	
	КонецЕсли;
	
Конецпроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	
	
	
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	 Статус=Неопределено; 
	 ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВидРабот<>Справочники.ВидыРаботСотрудников.Активация Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НоменклатураВыпуск");
	КонецЕсли;
	
	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	
	
КонецПроцедуры


#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли;
	
	
	Дата          = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	АвторДокумента=Ответственный.ФизическоеЛицо;
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
	
КонецПроцедуры

#КонецОбласти


#Область Дополнительно
Функция ПолучитьРаскройСтрокой() //+Лико m.shenderov 14.06.2022
	Строка="";
	
	Для каждого СтрРаскрой Из Раскрой  Цикл
		
		//Строка=Строка+СтрШаблон("%1-%2-%3;",СтрРаскрой.Нарезка,СтрРаскрой.КоличествоРоликов,СтрРаскрой.ДлинаРолика);
		Строка=Строка+СтрШаблон("%1-%2;",СтрРаскрой.Нарезка,СтрРаскрой.КоличествоРоликов);
		
		
		
	КонецЦикла; 
	Возврат ?(СтрДлина(Строка)>140,СтрШаблон("%1...",Лев(Строка,137)),Строка); 	
	
КонецФункции //-Лико m.shenderov 14.06.2022 

#КонецОбласти



#КонецОбласти
